import streamlit as st
from urllib.request import urlopen as request
import json
from bs4 import BeautifulSoup as soup

import matplotlib.pyplot as plt; plt.rcdefaults()
import numpy as np
import matplotlib.pyplot as plt 
from pandas.io.json import json_normalize

#Guidelines for each language ,string contains github flavoured markdown
def english():
        data='''
            ## Wash your hands frequently
            Regularly and thoroughly clean your hands with an alcohol-based hand rub or wash them with soap and water.
            Why? Washing your hands with soap and water or using alcohol-based hand rub kills viruses that may be on your hands.

            ## Maintain social distancing
            Maintain at least 1 metre (3 feet) distance between yourself and anyone who is coughing or sneezing.
            Why? When someone coughs or sneezes they spray small liquid droplets from their nose or mouth which may contain virus. If you are too close, you can breathe in the droplets, including the COVID-19 virus if the person coughing has the disease.

            ## Avoid touching eyes, nose and mouth
            Why? Hands touch many surfaces and can pick up viruses. Once contaminated, hands can transfer the virus to your eyes, nose or mouth. From there, the virus can enter your body and can make you sick.

            ## Practice respiratory hygiene
            Make sure you, and the people around you, follow good respiratory hygiene. This means covering your mouth and nose with your bent elbow or tissue when you cough or sneeze. Then dispose of the used tissue immediately.
            Why? Droplets spread virus. By following good respiratory hygiene you protect the people around you from viruses such as cold, flu and COVID-19.

            ## If you have fever, cough and difficulty breathing, seek medical care early
            Stay home if you feel unwell. If you have a fever, cough and difficulty breathing, seek medical attention and call in advance. Follow the directions of your local health authority.
            Why? National and local authorities will have the most up to date information on the situation in your area. Calling in advance will allow your health care provider to quickly direct you to the right health facility. This will also protect you and help prevent spread of viruses and other infections.

            ## Stay informed and follow advice given by your healthcare provider
            Stay informed on the latest developments about COVID-19. Follow advice given by your healthcare provider, your national and local public health authority or your employer on how to protect yourself and others from COVID-19.
            Why? National and local authorities will have the most up to date information on whether COVID-19 is spreading in your area. They are best placed to advise on what people in your area should be doing to protect themselves.
            '''
        return data
def tamil():
        data='''
            ## உங்கள் கைகளை அடிக்கடி கழுவ வேண்டும்
            உங்கள் கைகளை ஆல்கஹால் அடிப்படையிலான கை தடவினால் தவறாமல் மற்றும் முழுமையாக சுத்தம் செய்யுங்கள் அல்லது சோப்பு மற்றும் தண்ணீரில் கழுவவும்.
            ஏன்? சோப்பு மற்றும் தண்ணீரில் உங்கள் கைகளை கழுவுதல் அல்லது ஆல்கஹால் சார்ந்த கை தடவலைப் பயன்படுத்துவது உங்கள் கைகளில் இருக்கும் வைரஸ்களைக் கொல்லும்.

            ## சமூக தூரத்தை பராமரிக்கவும்
            உங்களுக்கும் இருமல் அல்லது தும்மும் எவருக்கும் இடையில் குறைந்தது 1 மீட்டர் (3 அடி) தூரத்தை பராமரிக்கவும்.
            ஏன்? யாராவது இருமல் அல்லது தும்மும்போது அவர்கள் மூக்கு அல்லது வாயிலிருந்து சிறிய திரவ துளிகளை தெளிக்கிறார்கள், அதில் வைரஸ் இருக்கலாம். நீங்கள் மிகவும் நெருக்கமாக இருந்தால், இருமல் உள்ளவருக்கு நோய் இருந்தால், COVID-19 வைரஸ் உள்ளிட்ட நீர்த்துளிகளில் சுவாசிக்கலாம்.

            ## கண்கள், மூக்கு மற்றும் வாயைத் தொடுவதைத் தவிர்க்கவும்
            ஏன்? கைகள் பல மேற்பரப்புகளைத் தொடுகின்றன மற்றும் வைரஸ்களை எடுக்கலாம். அசுத்தமானதும், கைகள் உங்கள் கண்கள், மூக்கு அல்லது வாய்க்கு வைரஸை மாற்றும். அங்கிருந்து, வைரஸ் உங்கள் உடலில் நுழைந்து உங்களை நோய்வாய்ப்படுத்தும்.

            ## சுவாச சுகாதாரம் பயிற்சி
            நீங்களும் உங்களைச் சுற்றியுள்ளவர்களும் நல்ல சுவாச சுகாதாரத்தைப் பின்பற்றுவதை உறுதிப்படுத்திக் கொள்ளுங்கள். நீங்கள் இருமல் அல்லது தும்மும்போது உங்கள் வளைந்த முழங்கை அல்லது திசுக்களால் உங்கள் வாய் மற்றும் மூக்கை மூடுவது இதன் பொருள். பின்னர் பயன்படுத்தப்பட்ட திசுக்களை உடனடியாக அப்புறப்படுத்துங்கள்.
            ஏன்? நீர்த்துளிகள் வைரஸ் பரவுகின்றன. நல்ல சுவாச சுகாதாரத்தைப் பின்பற்றுவதன் மூலம், உங்களைச் சுற்றியுள்ளவர்களை குளிர், காய்ச்சல் மற்றும் COVID-19 போன்ற வைரஸ்களிலிருந்து பாதுகாக்கிறீர்கள்.

            ## உங்களுக்கு காய்ச்சல், இருமல் மற்றும் சுவாசிப்பதில் சிரமம் இருந்தால், ஆரம்பத்தில் மருத்துவ உதவியை நாடுங்கள்
            உங்களுக்கு உடல்நிலை சரியில்லாமல் இருந்தால் வீட்டிலேயே இருங்கள். உங்களுக்கு காய்ச்சல், இருமல் மற்றும் சுவாசிப்பதில் சிரமம் இருந்தால், மருத்துவ சிகிச்சை பெற்று முன்கூட்டியே அழைக்கவும். உங்கள் உள்ளூர் சுகாதார அதிகாரத்தின் வழிமுறைகளைப் பின்பற்றவும்.
            ஏன்? உங்கள் பகுதியில் உள்ள நிலைமை குறித்த புதுப்பித்த தகவல்களை தேசிய மற்றும் உள்ளூர் அதிகாரிகள் வைத்திருப்பார்கள். முன்கூட்டியே அழைப்பது உங்கள் சுகாதார வழங்குநரை உங்களை சரியான சுகாதார வசதிக்கு விரைவாக வழிநடத்த அனுமதிக்கும். இது உங்களைப் பாதுகாக்கும் மற்றும் வைரஸ்கள் மற்றும் பிற நோய்த்தொற்றுகள் பரவாமல் தடுக்கவும் உதவும்.

            ## உங்கள் சுகாதார வழங்குநரின் ஆலோசனையைப் பின்பற்றுங்கள்
            COVID-19 பற்றிய சமீபத்திய முன்னேற்றங்கள் குறித்து தொடர்ந்து தெரிவிக்கவும். COVID-19 இலிருந்து உங்களையும் மற்றவர்களையும் எவ்வாறு பாதுகாப்பது என்பது குறித்து உங்கள் சுகாதார வழங்குநர், உங்கள் தேசிய மற்றும் உள்ளூர் பொது சுகாதார ஆணையம் அல்லது உங்கள் முதலாளி அளித்த ஆலோசனையைப் பின்பற்றவும்.
            ஏன்? உங்கள் பகுதியில் COVID-19 பரவுகிறதா என்பது குறித்த தேசிய மற்றும் உள்ளூர் அதிகாரிகளிடம் மிகவும் புதுப்பித்த தகவல்கள் இருக்கும். உங்கள் பகுதியில் உள்ளவர்கள் தங்களைக் காப்பாற்றிக் கொள்ள என்ன செய்ய வேண்டும் என்பதைப் பற்றி ஆலோசிக்க அவை சிறந்தவை.'''
        return data
def hindi():
    data='''
        ## अपने हाथों को बार-बार धोएं
        अपने हाथों को अल्कोहल-आधारित हाथ से नियमित रूप से और अच्छी तरह से साफ करें या उन्हें साबुन और पानी से धोएं।
        क्यों? अपने हाथों को साबुन और पानी से धोना या अल्कोहल-आधारित हाथ रगड़ना वायरस का उपयोग करता है जो आपके हाथों पर हो सकता है।

        ## सामाजिक दूरियां बनाए रखें
        कम से कम 1 मीटर (3 फीट) की दूरी पर अपने आप को और किसी को भी, जो खांस रहा है या छींक रहा है, के बीच दूरी बनाए रखें।
        क्यों? जब किसी को खांसी या छींक आती है तो वे अपनी नाक या मुंह से छोटी तरल बूंदें छिड़कते हैं जिनमें वायरस हो सकता है। यदि आप बहुत करीब हैं, तो आप खांसी में सांस ले सकते हैं, जिसमें सीओवीआईडी ​​-19 वायरस भी शामिल है यदि खांसी करने वाले व्यक्ति को यह बीमारी है।

        ## आंखों, नाक और मुंह को छूने से बचें
        क्यों? हाथ कई सतहों को छूते हैं और वायरस उठा सकते हैं। एक बार दूषित होने पर, हाथ वायरस को आपकी आंखों, नाक या मुंह में स्थानांतरित कर सकते हैं। वहां से, वायरस आपके शरीर में प्रवेश कर सकता है और आपको बीमार कर सकता है।

        ## श्वसन स्वच्छता का अभ्यास करें
        सुनिश्चित करें कि आप, और आपके आस-पास के लोग, अच्छी श्वसन स्वच्छता का पालन करें। इसका मतलब है खांसी या छींक आने पर अपनी मुड़ी हुई कोहनी या टिशू से अपने मुंह और नाक को ढंकना। फिर इस्तेमाल किए गए ऊतक का तुरंत निपटान करें।
        क्यों? बूंदों से वायरस फैलता है। अच्छी श्वसन स्वच्छता का पालन करके आप अपने आसपास के लोगों को सर्दी, फ्लू और सीओवीआईडी ​​-19 जैसे वायरस से बचाते हैं।

        ## अगर आपको बुखार, खांसी और सांस लेने में कठिनाई हो रही है, तो जल्द चिकित्सा सेवा लें
        यदि आप अस्वस्थ महसूस करते हैं तो घर पर रहें। यदि आपको बुखार, खांसी और सांस लेने में कठिनाई है, तो चिकित्सा पर ध्यान दें और पहले से फोन करें। अपने स्थानीय स्वास्थ्य प्राधिकरण के निर्देशों का पालन करें।
        क्यों? आपके क्षेत्र की स्थिति की जानकारी के लिए राष्ट्रीय और स्थानीय अधिकारियों के पास सबसे अधिक तारीख होगी। अग्रिम में कॉल करने से आपका स्वास्थ्य देखभाल प्रदाता आपको जल्दी से सही स्वास्थ्य सुविधा के लिए निर्देशित कर सकेगा। यह आपकी रक्षा भी करेगा और वायरस और अन्य संक्रमणों को फैलने से रोकने में मदद करेगा।

        ## सूचित रहें और अपने स्वास्थ्य सेवा प्रदाता द्वारा दी गई सलाह का पालन करें
        COVID-19 के बारे में नवीनतम घटनाओं से अवगत रहें। अपने स्वास्थ्य सेवा प्रदाता, अपने राष्ट्रीय और स्थानीय सार्वजनिक स्वास्थ्य प्राधिकरण या अपने नियोक्ता को COVID -19 से कैसे और कैसे बचाएं, इस पर दी गई सलाह का पालन करें।
        क्यों? आपके क्षेत्र में COVID-19 फैल रहा है या नहीं, इस पर राष्ट्रीय और स्थानीय अधिकारियों को सबसे अधिक जानकारी होगी। उन्हें इस बात की सलाह देने के लिए सर्वोत्तम स्थान दिया गया है कि आपके क्षेत्र के लोगों को अपनी सुरक्षा के लिए क्या करना चाहिए।'''
    return data
def gujarati():
    data='''
        ## વારંવાર તમારા હાથ ધોવા
        આલ્કોહોલ આધારિત હેન્ડ રબ સાથે તમારા હાથને નિયમિત અને સારી રીતે સાફ કરો અથવા સાબુ અને પાણીથી ધોઈ લો.
        કેમ? તમારા હાથને સાબુ અને પાણીથી ધોવા અથવા આલ્કોહોલ આધારિત હેન્ડ રબનો ઉપયોગ કરવાથી તમારા હાથ પરના વાયરસનો નાશ થાય છે.

        ## સામાજિક અંતર જાળવશો
        જાતે અને ખાંસી અથવા છીંક આવે છે તે કોઈપણ વચ્ચે ઓછામાં ઓછું 1 મીટર (3 ફુટ) અંતર જાળવવું.
        કેમ? જ્યારે કોઈને ઉધરસ આવે છે અથવા છીંક આવે છે, ત્યારે તેઓ તેમના નાક અથવા મોંમાંથી નાના પ્રવાહી ટીપાં છાંટતા હોય છે જેમાં વાયરસ હોઈ શકે છે. જો તમે ખૂબ નજીક છો, તો તમે ટીપાંમાં શ્વાસ લઈ શકો છો, જેમાં COVID-19 વાયરસનો સમાવેશ થાય છે, જો ખાંસી કરનાર વ્યક્તિને રોગ છે.

        ## આંખો, નાક અને મો touchાને સ્પર્શ કરવાનું ટાળો
        કેમ? હાથ ઘણી સપાટીઓને સ્પર્શ કરે છે અને વાયરસ પસંદ કરી શકે છે. દૂષિત થઈ ગયા પછી, હાથ તમારી આંખો, નાક અથવા મોંમાં વાયરસ સ્થાનાંતરિત કરી શકે છે. ત્યાંથી, વાયરસ તમારા શરીરમાં પ્રવેશી શકે છે અને તમને બીમાર બનાવી શકે છે.

        ## શ્વસન સ્વચ્છતાનો અભ્યાસ કરો
        ખાતરી કરો કે તમે અને તમારી આસપાસના લોકો, શ્વસનક્રિયાની સારી સ્વચ્છતાને અનુસરો. આનો અર્થ એ છે કે જ્યારે તમે ખાંસી અથવા છીંક લેશો ત્યારે તમારા વાળ અને કોષ અથવા પેશીથી તમારા મોં અને નાકને coveringાંકી દો. પછી વપરાયેલી પેશીઓનો તાત્કાલિક નિકાલ કરો.
        કેમ? ટીપું વાયરસ ફેલાવે છે. શ્વાસની સારી સ્વચ્છતાને અનુસરીને તમે તમારા આસપાસના લોકોને શરદી, ફ્લૂ અને કોવિડ -19 જેવા વાયરસથી સુરક્ષિત કરો છો.

        ## જો તમને તાવ, ઉધરસ અને શ્વાસ લેવામાં તકલીફ હોય તો વહેલા તબીબી સંભાળ લેવી
        જો તમને બીમારી લાગે તો ઘરે જ રહો. જો તમને તાવ, ઉધરસ અને શ્વાસ લેવામાં તકલીફ હોય, તો તબીબી સહાય મેળવો અને અગાઉથી ફોન કરો. તમારી સ્થાનિક આરોગ્ય સત્તાના નિર્દેશોનું પાલન કરો.
        કેમ? રાષ્ટ્રીય અને સ્થાનિક અધિકારીઓ પાસે તમારા ક્ષેત્રની પરિસ્થિતિ વિશેની અદ્યતન માહિતી હશે. અગાઉથી ક Callલ કરવાથી તમારા આરોગ્ય સંભાળ પ્રદાતા ઝડપથી તમને યોગ્ય આરોગ્ય સુવિધા તરફ દોરી શકે છે. આ તમારું રક્ષણ કરશે અને વાયરસ અને અન્ય ચેપના ફેલાવાને રોકવામાં પણ મદદ કરશે.

        ## માહિતગાર રહો અને તમારા હેલ્થકેર પ્રદાતા દ્વારા અપાયેલી સલાહને અનુસરો
        COVID-19 વિશે નવીનતમ વિકાસ પર માહિતગાર રહો. તમારા આરોગ્ય સંભાળ પ્રદાતા, તમારી રાષ્ટ્રીય અને સ્થાનિક જાહેર આરોગ્ય અધિકારી અથવા તમારા એમ્પ્લોયર દ્વારા આપેલી સલાહનું પાલન કરો કે કેવી રીતે તમારી જાતને અને અન્ય લોકોને COVID-19 થી બચાવવા.
        કેમ? રાષ્ટ્રીય અને સ્થાનિક સત્તાવાળાઓ પાસે તમારા વિસ્તારમાં COVID-19 ફેલાયેલ છે કે કેમ તે અંગેની અદ્યતન માહિતી હશે. તમારા ક્ષેત્રના લોકોએ પોતાને બચાવવા માટે શું કરવું જોઈએ તે અંગે સલાહ આપવા માટે તેમને શ્રેષ્ઠ સ્થાન આપવામાં આવ્યું છે.'''
    return data
def telugu():
    data='''
        ## మీ చేతులను తరచుగా కడగాలి
        మీ చేతులను ఆల్కహాల్ బేస్డ్ హ్యాండ్ రబ్ తో క్రమం తప్పకుండా శుభ్రంగా శుభ్రపరచండి లేదా సబ్బు మరియు నీటితో కడగాలి.
        ఎందుకు? మీ చేతులను సబ్బు మరియు నీటితో కడగడం లేదా ఆల్కహాల్ ఆధారిత హ్యాండ్ రబ్ ఉపయోగించడం వల్ల మీ చేతుల్లో ఉండే వైరస్లను చంపుతుంది.

        ## సామాజిక దూరాన్ని నిర్వహించండి
        మీకు మరియు దగ్గు లేదా తుమ్ము ఉన్నవారికి మధ్య కనీసం 1 మీటర్ (3 అడుగులు) దూరం నిర్వహించండి.
        ఎందుకు? ఎవరైనా దగ్గు లేదా తుమ్ము చేసినప్పుడు వారు ముక్కు లేదా నోటి నుండి చిన్న ద్రవ బిందువులను పిచికారీ చేస్తారు, ఇందులో వైరస్ ఉండవచ్చు. మీరు చాలా దగ్గరగా ఉంటే, దగ్గు వ్యక్తికి వ్యాధి ఉంటే మీరు COVID-19 వైరస్‌తో సహా బిందువులలో he పిరి పీల్చుకోవచ్చు.

        ## కళ్ళు, ముక్కు మరియు నోటిని తాకడం మానుకోండి
        ఎందుకు? చేతులు అనేక ఉపరితలాలను తాకుతాయి మరియు వైరస్లను తీయగలవు. కలుషితమైన తర్వాత, చేతులు మీ కళ్ళు, ముక్కు లేదా నోటికి వైరస్ను బదిలీ చేస్తాయి. అక్కడ నుండి, వైరస్ మీ శరీరంలోకి ప్రవేశిస్తుంది మరియు మిమ్మల్ని అనారోగ్యానికి గురి చేస్తుంది.

        ## శ్వాసకోశ పరిశుభ్రత పాటించండి
        మీరు మరియు మీ చుట్టుపక్కల ప్రజలు మంచి శ్వాసకోశ పరిశుభ్రతను అనుసరిస్తున్నారని నిర్ధారించుకోండి. మీరు దగ్గు లేదా తుమ్ము ఉన్నప్పుడు మీ వంగిన మోచేయి లేదా కణజాలంతో మీ నోరు మరియు ముక్కును కప్పడం దీని అర్థం. అప్పుడు ఉపయోగించిన కణజాలాన్ని వెంటనే పారవేయండి.
        ఎందుకు? బిందువులు వైరస్ వ్యాప్తి చెందుతాయి. మంచి శ్వాసకోశ పరిశుభ్రతను పాటించడం ద్వారా మీరు మీ చుట్టూ ఉన్న ప్రజలను జలుబు, ఫ్లూ మరియు COVID-19 వంటి వైరస్ల నుండి రక్షిస్తారు.

        ## మీకు జ్వరం, దగ్గు మరియు శ్వాస తీసుకోవడంలో ఇబ్బంది ఉంటే, ముందుగానే వైద్య సంరక్షణ తీసుకోండి
        మీకు అనారోగ్యం అనిపిస్తే ఇంట్లో ఉండండి. మీకు జ్వరం, దగ్గు మరియు శ్వాస తీసుకోవడంలో ఇబ్బంది ఉంటే, వైద్య సహాయం తీసుకోండి మరియు ముందుగానే కాల్ చేయండి. మీ స్థానిక ఆరోగ్య అధికారం యొక్క సూచనలను అనుసరించండి.
        ఎందుకు? మీ ప్రాంతంలోని పరిస్థితులపై జాతీయ మరియు స్థానిక అధికారులకు తాజా సమాచారం ఉంటుంది. ముందుగానే కాల్ చేస్తే మీ ఆరోగ్య సంరక్షణ ప్రదాత మిమ్మల్ని త్వరగా సరైన ఆరోగ్య సదుపాయానికి దారి తీస్తుంది. ఇది మిమ్మల్ని రక్షిస్తుంది మరియు వైరస్లు మరియు ఇతర ఇన్ఫెక్షన్ల వ్యాప్తిని నివారించడంలో సహాయపడుతుంది.

        ## సమాచారం ఇవ్వండి మరియు మీ ఆరోగ్య సంరక్షణ ప్రదాత ఇచ్చిన సలహాలను అనుసరించండి
        COVID-19 గురించి తాజా పరిణామాలపై సమాచారం ఇవ్వండి. COVID-19 నుండి మిమ్మల్ని మరియు ఇతరులను ఎలా రక్షించుకోవాలో మీ ఆరోగ్య సంరక్షణ ప్రదాత, మీ జాతీయ మరియు స్థానిక ప్రజారోగ్య అధికారం లేదా మీ యజమాని ఇచ్చిన సలహాలను అనుసరించండి.
        ఎందుకు? మీ ప్రాంతంలో COVID-19 వ్యాప్తి చెందుతుందా అనే దానిపై జాతీయ మరియు స్థానిక అధికారులకు తాజా సమాచారం ఉంటుంది. మీ ప్రాంతంలోని ప్రజలు తమను తాము రక్షించుకోవడానికి ఏమి చేయాలో సలహా ఇవ్వడానికి వారు ఉత్తమంగా ఉంచారు.'''
    return data
def punjabi():
    data='''
        ## ਆਪਣੇ ਹੱਥ ਅਕਸਰ ਧੋਵੋ
        ਆਪਣੇ ਹੱਥਾਂ ਨੂੰ ਨਿਯਮਿਤ ਅਤੇ ਚੰਗੀ ਤਰ੍ਹਾਂ ਅਲਕੋਹਲ ਅਧਾਰਤ ਹੱਥਾਂ ਨਾਲ ਰਗੜੋ ਜਾਂ ਸਾਬਣ ਅਤੇ ਪਾਣੀ ਨਾਲ ਧੋਵੋ.
        ਕਿਉਂ? ਆਪਣੇ ਹੱਥਾਂ ਨੂੰ ਸਾਬਣ ਅਤੇ ਪਾਣੀ ਨਾਲ ਧੋਣ ਜਾਂ ਅਲਕੋਹਲ ਅਧਾਰਤ ਹੱਥਾਂ ਦੀ ਰੱਬ ਦੀ ਵਰਤੋਂ ਵਾਇਰਸਾਂ ਨੂੰ ਮਾਰ ਦਿੰਦਾ ਹੈ ਜੋ ਤੁਹਾਡੇ ਹੱਥਾਂ ਤੇ ਹੋ ਸਕਦੇ ਹਨ.

        ## ਸਮਾਜਕ ਦੂਰੀ ਬਣਾਈ ਰੱਖੋ
        ਆਪਣੇ ਅਤੇ ਕਿਸੇ ਨੂੰ ਜੋ ਖੰਘ ਜਾਂ ਛਿੱਕ ਆ ਰਹੀ ਹੈ ਦੇ ਵਿਚਕਾਰ ਘੱਟੋ ਘੱਟ 1 ਮੀਟਰ (3 ਫੁੱਟ) ਦੀ ਦੂਰੀ ਬਣਾਈ ਰੱਖੋ.
        ਕਿਉਂ? ਜਦੋਂ ਕੋਈ ਖਾਂਸੀ ਖਾਂਦਾ ਹੈ ਜਾਂ ਛਿੱਕ ਮਾਰਦਾ ਹੈ ਤਾਂ ਉਹ ਆਪਣੇ ਨੱਕ ਜਾਂ ਮੂੰਹ ਵਿੱਚੋਂ ਥੋੜ੍ਹੀ ਜਿਹੀ ਤਰਲ ਬੂੰਦਾਂ ਸੁੱਟਦਾ ਹੈ ਜਿਸ ਵਿੱਚ ਵਾਇਰਸ ਹੋ ਸਕਦਾ ਹੈ. ਜੇ ਤੁਸੀਂ ਬਹੁਤ ਨੇੜੇ ਹੋ, ਤਾਂ ਤੁਸੀਂ ਬੂੰਦਾਂ ਵਿੱਚ ਸਾਹ ਲੈ ਸਕਦੇ ਹੋ, ਜਿਸ ਵਿੱਚ COVID-19 ਵਾਇਰਸ ਵੀ ਸ਼ਾਮਲ ਹੈ ਜੇ ਖੰਘ ਵਾਲੇ ਵਿਅਕਤੀ ਨੂੰ ਬਿਮਾਰੀ ਹੈ.

        ## ਅੱਖਾਂ, ਨੱਕ ਅਤੇ ਮੂੰਹ ਨੂੰ ਛੂਹਣ ਤੋਂ ਪਰਹੇਜ਼ ਕਰੋ
        ਕਿਉਂ? ਹੱਥ ਬਹੁਤ ਸਾਰੀਆਂ ਸਤਹਾਂ ਨੂੰ ਛੂੰਹਦੇ ਹਨ ਅਤੇ ਵਾਇਰਸਾਂ ਨੂੰ ਚੁਣ ਸਕਦੇ ਹਨ. ਇਕ ਵਾਰ ਦੂਸ਼ਿਤ ਹੋ ਜਾਣ ਤੋਂ ਬਾਅਦ, ਹੱਥ ਵਾਇਰਸ ਤੁਹਾਡੀਆਂ ਅੱਖਾਂ, ਨੱਕ ਜਾਂ ਮੂੰਹ ਵਿਚ ਤਬਦੀਲ ਕਰ ਸਕਦੇ ਹਨ. ਉਥੋਂ, ਵਾਇਰਸ ਤੁਹਾਡੇ ਸਰੀਰ ਵਿੱਚ ਦਾਖਲ ਹੋ ਸਕਦਾ ਹੈ ਅਤੇ ਤੁਹਾਨੂੰ ਬਿਮਾਰ ਬਣਾ ਸਕਦਾ ਹੈ.

        ## ਸਾਹ ਦੀ ਸਫਾਈ ਦਾ ਅਭਿਆਸ ਕਰੋ
        ਇਹ ਸੁਨਿਸ਼ਚਿਤ ਕਰੋ ਕਿ ਤੁਸੀਂ ਅਤੇ ਤੁਹਾਡੇ ਆਸ ਪਾਸ ਦੇ ਲੋਕ ਸਾਹ ਦੀ ਚੰਗੀ ਸਫਾਈ ਦਾ ਪਾਲਣ ਕਰਦੇ ਹਨ. ਇਸਦਾ ਅਰਥ ਹੈ ਜਦੋਂ ਤੁਸੀਂ ਖਾਂਸੀ ਜਾਂ ਛਿੱਕ ਲੈਂਦੇ ਹੋ ਤਾਂ ਆਪਣੇ ਮੂੰਹ ਅਤੇ ਨੱਕ ਨੂੰ ਆਪਣੀ ਝੁਕਿਆ ਕੂਹਣੀ ਜਾਂ ਟਿਸ਼ੂ ਨਾਲ coveringੱਕੋ. ਫਿਰ ਵਰਤੇ ਗਏ ਟਿਸ਼ੂਆਂ ਦਾ ਤੁਰੰਤ ਨਿਪਟਾਰਾ ਕਰੋ.
        ਕਿਉਂ? ਬੂੰਦਾਂ ਵਾਇਰਸ ਫੈਲਦੀਆਂ ਹਨ. ਸਾਹ ਦੀ ਚੰਗੀ ਸਿਹਤ ਦਾ ਪਾਲਣ ਕਰਕੇ ਤੁਸੀਂ ਆਪਣੇ ਆਲੇ ਦੁਆਲੇ ਦੇ ਲੋਕਾਂ ਨੂੰ ਵਾਇਰਸਾਂ ਤੋਂ ਬਚਾਓ ਜਿਵੇਂ ਕਿ ਠੰਡੇ, ਫਲੂ ਅਤੇ ਕੋਵਿਡ -19.

        ## ਜੇ ਤੁਹਾਨੂੰ ਬੁਖਾਰ, ਖੰਘ ਅਤੇ ਸਾਹ ਲੈਣ ਵਿੱਚ ਮੁਸ਼ਕਲ ਆਉਂਦੀ ਹੈ, ਤਾਂ ਜਲਦੀ ਡਾਕਟਰੀ ਦੇਖਭਾਲ ਕਰੋ
        ਜੇ ਤੁਸੀਂ ਬੀਮਾਰ ਮਹਿਸੂਸ ਕਰਦੇ ਹੋ ਤਾਂ ਘਰ ਰਹੋ. ਜੇ ਤੁਹਾਨੂੰ ਬੁਖਾਰ, ਖਾਂਸੀ ਅਤੇ ਸਾਹ ਲੈਣ ਵਿੱਚ ਮੁਸ਼ਕਲ ਆਉਂਦੀ ਹੈ, ਤਾਂ ਡਾਕਟਰੀ ਸਹਾਇਤਾ ਲਓ ਅਤੇ ਪਹਿਲਾਂ ਤੋਂ ਕਾਲ ਕਰੋ. ਆਪਣੇ ਸਥਾਨਕ ਸਿਹਤ ਅਥਾਰਟੀ ਦੇ ਨਿਰਦੇਸ਼ਾਂ ਦੀ ਪਾਲਣਾ ਕਰੋ.
        ਕਿਉਂ? ਰਾਸ਼ਟਰੀ ਅਤੇ ਸਥਾਨਕ ਅਧਿਕਾਰੀਆਂ ਕੋਲ ਤੁਹਾਡੇ ਖੇਤਰ ਦੀ ਸਥਿਤੀ ਬਾਰੇ ਸਭ ਤੋਂ ਤਾਜ਼ਾ ਜਾਣਕਾਰੀ ਹੋਵੇਗੀ. ਪਹਿਲਾਂ ਤੋਂ ਕਾਲ ਕਰਨਾ ਤੁਹਾਡੇ ਸਿਹਤ ਦੇਖਭਾਲ ਪ੍ਰਦਾਤਾ ਨੂੰ ਤੁਰੰਤ ਤੁਹਾਨੂੰ ਸਹੀ ਸਿਹਤ ਸਹੂਲਤ ਵੱਲ ਭੇਜਣ ਦੀ ਆਗਿਆ ਦੇਵੇਗਾ. ਇਹ ਤੁਹਾਡੀ ਰੱਖਿਆ ਕਰੇਗੀ ਅਤੇ ਵਾਇਰਸਾਂ ਅਤੇ ਹੋਰ ਲਾਗਾਂ ਦੇ ਫੈਲਣ ਨੂੰ ਰੋਕਣ ਵਿੱਚ ਸਹਾਇਤਾ ਕਰੇਗੀ.

        ## ਸੂਚਿਤ ਰਹੋ ਅਤੇ ਆਪਣੇ ਸਿਹਤ ਸੰਭਾਲ ਪ੍ਰਦਾਤਾ ਦੁਆਰਾ ਦਿੱਤੀ ਸਲਾਹ ਦੀ ਪਾਲਣਾ ਕਰੋ
        COVID-19 ਬਾਰੇ ਤਾਜ਼ਾ ਘਟਨਾਕ੍ਰਮ ਬਾਰੇ ਜਾਣੂ ਕਰੋ. ਆਪਣੇ ਸਿਹਤ ਦੇਖਭਾਲ ਪ੍ਰਦਾਤਾ, ਆਪਣੀ ਰਾਸ਼ਟਰੀ ਅਤੇ ਸਥਾਨਕ ਜਨਤਕ ਸਿਹਤ ਅਥਾਰਟੀ ਜਾਂ ਤੁਹਾਡੇ ਮਾਲਕ ਦੁਆਰਾ ਦਿੱਤੀ ਸਲਾਹ ਦੀ ਪਾਲਣਾ ਕਰੋ ਕਿ ਆਪਣੇ ਆਪ ਨੂੰ ਅਤੇ ਦੂਜਿਆਂ ਨੂੰ COVID-19 ਤੋਂ ਕਿਵੇਂ ਬਚਾਇਆ ਜਾਵੇ.
        ਕਿਉਂ? ਕੌਮੀ ਅਤੇ ਸਥਾਨਕ ਅਥਾਰਟੀਆਂ ਕੋਲ ਇਸ ਬਾਰੇ ਨਵੀਨਤਮ ਜਾਣਕਾਰੀ ਰਹੇਗੀ ਕਿ ਕੀ ਕੋਵਿਡ -19 ਤੁਹਾਡੇ ਖੇਤਰ ਵਿੱਚ ਫੈਲ ਰਹੀ ਹੈ. ਉਨ੍ਹਾਂ ਨੂੰ ਸਲਾਹ ਦਿੱਤੀ ਜਾਂਦੀ ਹੈ ਕਿ ਤੁਹਾਡੇ ਖੇਤਰ ਦੇ ਲੋਕਾਂ ਨੂੰ ਆਪਣੀ ਰੱਖਿਆ ਲਈ ਕੀ ਕਰਨਾ ਚਾਹੀਦਾ ਹੈ.
    '''
    return data
def malayalam():
    data='''
        ## ഇടയ്ക്കിടെ കൈ കഴുകുക
        മദ്യം അടിസ്ഥാനമാക്കിയുള്ള കൈകൊണ്ട് നിങ്ങളുടെ കൈകൾ പതിവായി നന്നായി വൃത്തിയാക്കുക അല്ലെങ്കിൽ സോപ്പും വെള്ളവും ഉപയോഗിച്ച് കഴുകുക.
        എന്തുകൊണ്ട്? സോപ്പും വെള്ളവും ഉപയോഗിച്ച് കൈ കഴുകുകയോ മദ്യം അടിസ്ഥാനമാക്കിയുള്ള ഹാൻഡ് റബ് ഉപയോഗിക്കുകയോ ചെയ്യുന്നത് നിങ്ങളുടെ കൈകളിലെ വൈറസുകളെ കൊല്ലുന്നു.

        ## സാമൂഹിക അകലം പാലിക്കുക
        നിങ്ങളും ചുമയോ തുമ്മലോ ഉള്ള ഏതൊരാളും തമ്മിൽ കുറഞ്ഞത് 1 മീറ്റർ (3 അടി) ദൂരം നിലനിർത്തുക.
        എന്തുകൊണ്ട്? ആരെങ്കിലും ചുമയോ തുമ്മുകയോ ചെയ്യുമ്പോൾ മൂക്കിൽ നിന്നോ വായിൽ നിന്നോ ചെറിയ ദ്രാവക തുള്ളികൾ തളിക്കുന്നു, അതിൽ വൈറസ് അടങ്ങിയിരിക്കാം. നിങ്ങൾ വളരെ അടുത്താണെങ്കിൽ, ചുമ ചെയ്യുന്ന വ്യക്തിക്ക് രോഗമുണ്ടെങ്കിൽ നിങ്ങൾക്ക് COVID-19 വൈറസ് ഉൾപ്പെടെയുള്ള തുള്ളികളിൽ ശ്വസിക്കാം.

        ## കണ്ണുകൾ, മൂക്ക്, വായ എന്നിവ തൊടുന്നത് ഒഴിവാക്കുക
        എന്തുകൊണ്ട്? കൈകൾ നിരവധി ഉപരിതലങ്ങളിൽ സ്പർശിക്കുകയും വൈറസുകൾ എടുക്കുകയും ചെയ്യും. മലിനമായാൽ, കൈകൾക്ക് നിങ്ങളുടെ കണ്ണുകളിലേക്കോ മൂക്കിലേക്കോ വായിലേക്കോ വൈറസ് കൈമാറാൻ കഴിയും. അവിടെ നിന്ന്, വൈറസ് നിങ്ങളുടെ ശരീരത്തിൽ പ്രവേശിക്കുകയും നിങ്ങളെ രോഗിയാക്കുകയും ചെയ്യും.

        ## ശ്വസന ശുചിത്വം പാലിക്കുക
        നിങ്ങളും നിങ്ങളുടെ ചുറ്റുമുള്ള ആളുകളും നല്ല ശ്വസന ശുചിത്വം പാലിക്കുന്നുണ്ടെന്ന് ഉറപ്പാക്കുക. ചുമ അല്ലെങ്കിൽ തുമ്മൽ വരുമ്പോൾ വളഞ്ഞ കൈമുട്ട് അല്ലെങ്കിൽ ടിഷ്യു ഉപയോഗിച്ച് വായും മൂക്കും മൂടുക എന്നാണ് ഇതിനർത്ഥം. ഉപയോഗിച്ച ടിഷ്യു ഉടനടി നീക്കം ചെയ്യുക.
        എന്തുകൊണ്ട്? തുള്ളികൾ വൈറസ് പടരുന്നു. നല്ല ശ്വസന ശുചിത്വം പാലിക്കുന്നതിലൂടെ നിങ്ങൾക്ക് ചുറ്റുമുള്ള ആളുകളെ ജലദോഷം, പനി, COVID-19 തുടങ്ങിയ വൈറസുകളിൽ നിന്ന് സംരക്ഷിക്കുന്നു.

        ## നിങ്ങൾക്ക് പനി, ചുമ, ശ്വസിക്കാൻ ബുദ്ധിമുട്ട് എന്നിവ ഉണ്ടെങ്കിൽ നേരത്തെ വൈദ്യസഹായം തേടുക
        നിങ്ങൾക്ക് അസുഖം തോന്നുന്നുവെങ്കിൽ വീട്ടിൽ തന്നെ തുടരുക. നിങ്ങൾക്ക് പനിയും ചുമയും ശ്വസിക്കാൻ ബുദ്ധിമുട്ടും ഉണ്ടെങ്കിൽ വൈദ്യസഹായം തേടുകയും മുൻകൂട്ടി വിളിക്കുകയും ചെയ്യുക. നിങ്ങളുടെ പ്രാദേശിക ആരോഗ്യ അതോറിറ്റിയുടെ നിർദ്ദേശങ്ങൾ പാലിക്കുക.
        എന്തുകൊണ്ട്? നിങ്ങളുടെ പ്രദേശത്തെ അവസ്ഥയെക്കുറിച്ച് ഏറ്റവും പുതിയ വിവരങ്ങൾ ദേശീയ, പ്രാദേശിക അധികാരികൾക്ക് ഉണ്ടായിരിക്കും. മുൻ‌കൂട്ടി വിളിക്കുന്നത് നിങ്ങളുടെ ആരോഗ്യ പരിരക്ഷാ ദാതാവിനെ നിങ്ങളെ ശരിയായ ആരോഗ്യ സ to കര്യത്തിലേക്ക് വേഗത്തിൽ നയിക്കാൻ അനുവദിക്കും. ഇത് നിങ്ങളെ പരിരക്ഷിക്കുകയും വൈറസുകളുടെയും മറ്റ് അണുബാധകളുടെയും വ്യാപനം തടയാനും സഹായിക്കും.

        ## വിവരമറിയിക്കുകയും നിങ്ങളുടെ ആരോഗ്യ പരിരക്ഷാ ദാതാവിന്റെ ഉപദേശങ്ങൾ പാലിക്കുകയും ചെയ്യുക
        COVID-19 നെക്കുറിച്ചുള്ള ഏറ്റവും പുതിയ സംഭവവികാസങ്ങളെക്കുറിച്ച് അറിഞ്ഞിരിക്കുക. COVID-19 ൽ നിന്ന് നിങ്ങളെയും മറ്റുള്ളവരെയും എങ്ങനെ സംരക്ഷിക്കാമെന്ന് നിങ്ങളുടെ ആരോഗ്യ പരിരക്ഷാ ദാതാവ്, നിങ്ങളുടെ ദേശീയ, പ്രാദേശിക പൊതുജനാരോഗ്യ അതോറിറ്റി അല്ലെങ്കിൽ നിങ്ങളുടെ തൊഴിലുടമ നൽകിയ ഉപദേശങ്ങൾ പാലിക്കുക.
        എന്തുകൊണ്ട്? നിങ്ങളുടെ പ്രദേശത്ത് COVID-19 വ്യാപിക്കുന്നുണ്ടോ എന്നതിനെക്കുറിച്ചുള്ള ഏറ്റവും പുതിയ വിവരങ്ങൾ ദേശീയ, പ്രാദേശിക അധികാരികൾക്ക് ഉണ്ടായിരിക്കും. നിങ്ങളുടെ പ്രദേശത്തെ ആളുകൾ സ്വയം പരിരക്ഷിക്കാൻ എന്തുചെയ്യണമെന്ന് ഉപദേശിക്കുന്നതിനാണ് അവ ഏറ്റവും മികച്ചത്.'''
    return data
def kannada():
    data='''
        ## ನಿಮ್ಮ ಕೈಗಳನ್ನು ಆಗಾಗ್ಗೆ ತೊಳೆಯಿರಿ
        ನಿಯಮಿತವಾಗಿ ಮತ್ತು ಸಂಪೂರ್ಣವಾಗಿ ನಿಮ್ಮ ಕೈಗಳನ್ನು ಆಲ್ಕೋಹಾಲ್ ಆಧಾರಿತ ಹ್ಯಾಂಡ್ ರಬ್ನಿಂದ ಸ್ವಚ್ clean ಗೊಳಿಸಿ ಅಥವಾ ಸೋಪ್ ಮತ್ತು ನೀರಿನಿಂದ ತೊಳೆಯಿರಿ.
        ಏಕೆ? ನಿಮ್ಮ ಕೈಗಳನ್ನು ಸೋಪ್ ಮತ್ತು ನೀರಿನಿಂದ ತೊಳೆಯುವುದು ಅಥವಾ ಆಲ್ಕೋಹಾಲ್ ಆಧಾರಿತ ಹ್ಯಾಂಡ್ ರಬ್ ಬಳಸುವುದರಿಂದ ನಿಮ್ಮ ಕೈಯಲ್ಲಿರುವ ವೈರಸ್‌ಗಳನ್ನು ಕೊಲ್ಲುತ್ತದೆ.

        ## ಸಾಮಾಜಿಕ ದೂರವನ್ನು ಕಾಪಾಡಿಕೊಳ್ಳಿ
        ನಿಮ್ಮ ಮತ್ತು ಕೆಮ್ಮು ಅಥವಾ ಸೀನುವವರ ನಡುವೆ ಕನಿಷ್ಠ 1 ಮೀಟರ್ (3 ಅಡಿ) ಅಂತರವನ್ನು ಕಾಪಾಡಿಕೊಳ್ಳಿ.
        ಏಕೆ? ಯಾರಾದರೂ ಕೆಮ್ಮಿದಾಗ ಅಥವಾ ಸೀನುವಾಗ ಅವರು ಮೂಗು ಅಥವಾ ಬಾಯಿಯಿಂದ ಸಣ್ಣ ದ್ರವ ಹನಿಗಳನ್ನು ಸಿಂಪಡಿಸುತ್ತಾರೆ, ಅದು ವೈರಸ್ ಅನ್ನು ಹೊಂದಿರಬಹುದು. ನೀವು ತುಂಬಾ ಹತ್ತಿರದಲ್ಲಿದ್ದರೆ, ಕೆಮ್ಮುವ ವ್ಯಕ್ತಿಗೆ ಕಾಯಿಲೆ ಇದ್ದರೆ ನೀವು COVID-19 ವೈರಸ್ ಸೇರಿದಂತೆ ಹನಿಗಳಲ್ಲಿ ಉಸಿರಾಡಬಹುದು.

        ## ಕಣ್ಣು, ಮೂಗು ಮತ್ತು ಬಾಯಿಯನ್ನು ಸ್ಪರ್ಶಿಸುವುದನ್ನು ತಪ್ಪಿಸಿ
        ಏಕೆ? ಕೈಗಳು ಅನೇಕ ಮೇಲ್ಮೈಗಳನ್ನು ಸ್ಪರ್ಶಿಸುತ್ತವೆ ಮತ್ತು ವೈರಸ್‌ಗಳನ್ನು ತೆಗೆದುಕೊಳ್ಳಬಹುದು. ಕಲುಷಿತಗೊಂಡ ನಂತರ, ಕೈಗಳು ನಿಮ್ಮ ಕಣ್ಣು, ಮೂಗು ಅಥವಾ ಬಾಯಿಗೆ ವೈರಸ್ ಅನ್ನು ವರ್ಗಾಯಿಸಬಹುದು. ಅಲ್ಲಿಂದ, ವೈರಸ್ ನಿಮ್ಮ ದೇಹವನ್ನು ಪ್ರವೇಶಿಸಬಹುದು ಮತ್ತು ನಿಮ್ಮನ್ನು ರೋಗಿಗಳನ್ನಾಗಿ ಮಾಡಬಹುದು.

        ## ಉಸಿರಾಟದ ನೈರ್ಮಲ್ಯವನ್ನು ಅಭ್ಯಾಸ ಮಾಡಿ
        ನೀವು ಮತ್ತು ನಿಮ್ಮ ಸುತ್ತಮುತ್ತಲಿನ ಜನರು ಉತ್ತಮ ಉಸಿರಾಟದ ನೈರ್ಮಲ್ಯವನ್ನು ಅನುಸರಿಸುತ್ತೀರಾ ಎಂದು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ. ಇದರರ್ಥ ನೀವು ಕೆಮ್ಮುವಾಗ ಅಥವಾ ಸೀನುವಾಗ ನಿಮ್ಮ ಬಾಗಿದ ಮೊಣಕೈ ಅಥವಾ ಅಂಗಾಂಶದಿಂದ ನಿಮ್ಮ ಬಾಯಿ ಮತ್ತು ಮೂಗನ್ನು ಮುಚ್ಚಿಕೊಳ್ಳುವುದು. ನಂತರ ಬಳಸಿದ ಅಂಗಾಂಶವನ್ನು ತಕ್ಷಣ ವಿಲೇವಾರಿ ಮಾಡಿ.
        ಏಕೆ? ಹನಿಗಳು ವೈರಸ್ ಹರಡುತ್ತವೆ. ಉತ್ತಮ ಉಸಿರಾಟದ ನೈರ್ಮಲ್ಯವನ್ನು ಅನುಸರಿಸುವ ಮೂಲಕ ನಿಮ್ಮ ಸುತ್ತಲಿನ ಜನರನ್ನು ಶೀತ, ಜ್ವರ ಮತ್ತು COVID-19 ನಂತಹ ವೈರಸ್‌ಗಳಿಂದ ರಕ್ಷಿಸುತ್ತೀರಿ.

        ## ನಿಮಗೆ ಜ್ವರ, ಕೆಮ್ಮು ಮತ್ತು ಉಸಿರಾಟದ ತೊಂದರೆ ಇದ್ದರೆ, ಮೊದಲೇ ವೈದ್ಯಕೀಯ ಆರೈಕೆ ಮಾಡಿ
        ನಿಮಗೆ ಅನಾರೋಗ್ಯ ಅನಿಸಿದರೆ ಮನೆಯಲ್ಲೇ ಇರಿ. ನಿಮಗೆ ಜ್ವರ, ಕೆಮ್ಮು ಮತ್ತು ಉಸಿರಾಟದ ತೊಂದರೆ ಇದ್ದರೆ, ವೈದ್ಯಕೀಯ ಚಿಕಿತ್ಸೆ ಪಡೆಯಿರಿ ಮತ್ತು ಮುಂಚಿತವಾಗಿ ಕರೆ ಮಾಡಿ. ನಿಮ್ಮ ಸ್ಥಳೀಯ ಆರೋಗ್ಯ ಪ್ರಾಧಿಕಾರದ ನಿರ್ದೇಶನಗಳನ್ನು ಅನುಸರಿಸಿ.
        ಏಕೆ? ನಿಮ್ಮ ಪ್ರದೇಶದ ಪರಿಸ್ಥಿತಿಯ ಬಗ್ಗೆ ರಾಷ್ಟ್ರೀಯ ಮತ್ತು ಸ್ಥಳೀಯ ಅಧಿಕಾರಿಗಳು ಹೆಚ್ಚು ನವೀಕೃತ ಮಾಹಿತಿಯನ್ನು ಹೊಂದಿರುತ್ತಾರೆ. ಮುಂಚಿತವಾಗಿ ಕರೆ ಮಾಡುವುದರಿಂದ ನಿಮ್ಮ ಆರೋಗ್ಯ ರಕ್ಷಣೆ ನೀಡುಗರು ನಿಮ್ಮನ್ನು ಸರಿಯಾದ ಆರೋಗ್ಯ ಸೌಲಭ್ಯಕ್ಕೆ ತ್ವರಿತವಾಗಿ ನಿರ್ದೇಶಿಸಲು ಅನುವು ಮಾಡಿಕೊಡುತ್ತದೆ. ಇದು ನಿಮ್ಮನ್ನು ರಕ್ಷಿಸುತ್ತದೆ ಮತ್ತು ವೈರಸ್ ಮತ್ತು ಇತರ ಸೋಂಕುಗಳ ಹರಡುವಿಕೆಯನ್ನು ತಡೆಯಲು ಸಹಾಯ ಮಾಡುತ್ತದೆ.

        ## ನಿಮ್ಮ ಆರೋಗ್ಯ ರಕ್ಷಣೆ ನೀಡುಗರು ನೀಡಿದ ಸಲಹೆಯನ್ನು ಅನುಸರಿಸಿ
        COVID-19 ಬಗ್ಗೆ ಇತ್ತೀಚಿನ ಬೆಳವಣಿಗೆಗಳ ಬಗ್ಗೆ ಮಾಹಿತಿ ನೀಡಿ. COVID-19 ನಿಂದ ನಿಮ್ಮನ್ನು ಮತ್ತು ಇತರರನ್ನು ಹೇಗೆ ರಕ್ಷಿಸಿಕೊಳ್ಳಬೇಕು ಎಂಬುದರ ಕುರಿತು ನಿಮ್ಮ ಆರೋಗ್ಯ ಪೂರೈಕೆದಾರ, ನಿಮ್ಮ ರಾಷ್ಟ್ರೀಯ ಮತ್ತು ಸ್ಥಳೀಯ ಸಾರ್ವಜನಿಕ ಆರೋಗ್ಯ ಪ್ರಾಧಿಕಾರ ಅಥವಾ ನಿಮ್ಮ ಉದ್ಯೋಗದಾತ ನೀಡಿದ ಸಲಹೆಯನ್ನು ಅನುಸರಿಸಿ.
        ಏಕೆ? ನಿಮ್ಮ ಪ್ರದೇಶದಲ್ಲಿ COVID-19 ಹರಡುತ್ತಿದೆಯೇ ಎಂಬ ಬಗ್ಗೆ ರಾಷ್ಟ್ರೀಯ ಮತ್ತು ಸ್ಥಳೀಯ ಅಧಿಕಾರಿಗಳು ಹೆಚ್ಚು ನವೀಕೃತ ಮಾಹಿತಿಯನ್ನು ಹೊಂದಿರುತ್ತಾರೆ. ನಿಮ್ಮ ಪ್ರದೇಶದ ಜನರು ತಮ್ಮನ್ನು ತಾವು ರಕ್ಷಿಸಿಕೊಳ್ಳಲು ಏನು ಮಾಡಬೇಕು ಎಂಬುದರ ಕುರಿತು ಸಲಹೆ ನೀಡಲು ಅವರನ್ನು ಉತ್ತಮವಾಗಿ ಇರಿಸಲಾಗಿದೆ.'''
    return data


def helpline():
    data='''
        ## Central Helpline Number  - +91-11-23978046

        # State Helpline Nos.

        ## Andhra Pradesh 0866-2410978
        ##  Arunachal Pradesh 9436055743
        ## Assam 6913347770
        ## Bihar 104
        ## Chhattisgarh 104
        ## Goa 104
        ## Gujarat 104
        ## Haryana 8558893911
        ## Himachal Pradesh 104
        ## Jharkhand 104
        ## Karnataka 104
        ## Kerala 0471-2552056
        ## Madhya Pradesh 0755-2527177
        ## Maharashtra 020-26127394
        ## Manipur 3852411668
        ## Meghalaya 108
        ## Mizoram 102
        ## Nagaland 7005539653
        ## Odisha 9439994859
        ## Punjab 104
        ## Rajasthan 0141-2225624
        ## Sikkim 104
        ## Tamil Nadu 044-29510500
        ## Telangana 104
        ## Tripura 0381-2315879
        ## Uttarakhand 104
        ## Uttar Pradesh 18001805145
        ## West Bengal 1800313444222, 03323412600,
        # Union Territory (UT) Helpline Nos.
        ## Andaman and Nicobar Islands 03192-232102
        ## Chandigarh 9779558282
        ## Dadra and Nagar Haveli and Daman & Diu 104
        ## Delhi 011-22307145
        ## Jammu & Kashmir 01912520982, 0194-2440283
        ## Ladakh 01982256462
        ## Lakshadweep 104
        ## Puducherry 104'''
    return data


#labelling the bar plot
def autolabel(rects):
    
    for rect in rects:
        height = rect.get_height()
        plt.text(rect.get_x() + rect.get_width()/2., int(height),
                '%d' %int(height),
        ha='center', va='bottom')

def getdata():
    url='https://coronavirus-tracker-api.herokuapp.com/v2/locations'
    data=request(url)
    data=data.read()

    final_data=json.loads(data)
    final_data=final_data['locations']

    sorted_data=sorted(final_data,key=lambda k: k['latest']['confirmed'],reverse=True)

    
    df=json_normalize(sorted_data)
    df=df.drop(['coordinates.longitude','coordinates.latitude','last_updated','latest.recovered','id','country_code'],axis=1)
    df.rename(columns = {'province':'Province','latest.deaths':'Deaths','latest.confirmed':'Confirmed Cases','country':'Country'}, inplace = True)
    #df.columns=['Country','Confirmed Cases','Deaths','Province',]

    
    return df
def main():
    st.title('COVID - 19')
    #st.header('COVID-19')
    menuItems=['Guidelines','Statistics','Helpline']
    st.sidebar.title('Menu')
    
    
    itemSelected=st.sidebar.selectbox('',menuItems)
    hide_streamlit_style = """
            <style>
            #MainMenu {visibility: hidden;}
            footer {visibility: hidden;}
            </style>
            """
    st.markdown(hide_streamlit_style, unsafe_allow_html=True)
    st.sidebar.info('Made by Abhay')

    if(itemSelected=='Helpline'):
        st.markdown(helpline())
   


    if(itemSelected=='Guidelines'):
        
        langugaes=['English','हिंदी','ગુજરાતી','தமிழ்','తెలుగు','ਪੰਜਾਬੀ','മലയാളം','ಕನ್ನಡ']
        lang=st.selectbox('Choose Langugae',langugaes)
        st.subheader('WHO Guidelines')
        
        if(lang=='English'):
           st.markdown(english())
        elif(lang=='தமிழ்'):
            st.markdown(tamil())
        elif(lang=='हिंदी'):
            st.markdown(hindi())
        elif(lang=='ગુજરાતી'):
            st.markdown(gujarati())
        elif(lang=='తెలుగు'):
            st.markdown(telugu())
        elif(lang=='ਪੰਜਾਬੀ'):
            st.markdown(punjabi())
        elif(lang=='മലയാളം'):
            st.markdown(malayalam())
        elif(lang=='ಕನ್ನಡ'):
            st.markdown(kannada())
        

    if(itemSelected=='Statistics'):
        ogstatsurl='https://coronavirus-tracker-api.herokuapp.com/v2/latest'
        client=request(ogstatsurl)
        data=client.read()
        client.close()
        final=json.loads(data)
        
        confnum=final['latest']['confirmed']
        confirmed='''## Confirmed Cases ```  %d``` '''%(final['latest']['confirmed'])
        st.markdown(confirmed)

        deathnum=final['latest']['deaths']
        deaths='''## Deaths ``` %d ``` '''%(final['latest']['deaths'])
        st.markdown(deaths)
        url='https://www.worldometers.info/coronavirus/'
        client=request(url)
        raw_html=client.read()
        parsed_html=soup(raw_html,'html.parser')
        recoverednum=parsed_html.find('div',{'style':'color:#8ACA2B '}).text
        recovered='''## Recovered ``` %s ``` '''%((recoverednum).strip().replace(",",""))
        st.markdown(recovered)

        recoverednum=recoverednum.strip().replace(",","")
        objects = ('Recovered', 'Deaths', 'Active')
        y_pos = np.arange(len(objects))
        active=int(confnum)-(int(recoverednum)+int(deathnum))
        values = [int(recoverednum),int(deathnum),int(active)]
        ax=plt.bar(y_pos, values, align='center', alpha=0.7)
        plt.xticks(y_pos, objects)
        
        plt.title('COVID-19')
        autolabel(ax)
        st.write(mpl_fig=ax)
        st.pyplot()

        
        df=getdata()
        country_list=df['Country'].tolist()
        c=set(country_list)
        country_list=list(c)
        country_list=sorted(country_list)
        
        choice=st.selectbox('Choose Country',country_list)
        value=df.loc[df['Country']==choice]
        st.table(value)

        
        st.table(df)
        

plt.show()
        



if __name__ == '__main__':
    main()

